Line1 = ["金盆丘(铜官窑)","金霞","鹅羊山","秀峰山","宿龙桥","开福区政府","马厂","北辰三角洲","开福寺","文昌阁",
         "培元桥","五一广场","黄兴广场","南门口","侯家塘","南湖路","黄土岭","涂家冲","铁道学院","友谊路",
         "省政府","桂花坪","大托","中信广场","尚双塘"]
Line2 = ["光达","长沙火车南站","杜花路","沙湾公园","长沙大道","人民东路","万家丽广场","锦泰广场","长沙火车站","袁家岭",
         "迎宾路","芙蓉广场","五一广场","湘江中路","橘子洲","溁湾镇","西湖公园","金星路","望城坡","梅溪湖东",
         "文化艺术中心","麓云路","梅溪湖西"]
Line3 = ["湘潭北","船形山","黄家湾","双湖","坪塘","红桥","桐溪","大王山","山塘","洋湖湿地",
         "洋湖新城","阳光","中南大学","阜埠河","灵官渡","侯家塘","东塘","桂花公园","阿弥岭","朝阳村",
         "长沙火车站","烈士公园东","丝茅冲","四方坪","雅雀湖","长沙大学","月湖公园北","湘龙","星沙","松雅湖(南)",
         "星沙文体中心","螺丝塘","广生"]
Line4 = ["罐子岭","月亮岛西","湘江新城","汉王陵公园","福元路大桥西","茶子山","观沙岭","六沟垅","望月湖","溁湾镇",
         "湖南师大","湖南大学","阜埠河","碧沙湖","黄土岭","砂子塘","赤岗岭","树木岭","圭塘","沙湾公园",
         "粟塘","平阳","长沙火车南站","光达","杜家坪"]
Line5 = ["水渡河","土桥","白茅铺","月湖公园北","马栏山","鸭子铺","火炬村","马王堆","万家丽广场","芙蓉区政府",
         "高桥北","高桥南","圭塘","木桥","雨花区政府","大塘","板塘冲","毛竹塘"]
Line6 = ["谢家桥","象鼻窝","中塘站","一师范西校区","长庆","和馨园","长丰","麓谷体育公园","麓谷公园","涧塘",
         "湖南工商大学","白鸽咀","湘雅三医院","六沟垅","文昌阁","湘雅医院","烈士公园南","迎宾路口","窑岭湘雅二医院","朝阳村",
         "芙蓉区政府","人民东路","花桥","隆平水稻博物馆","农科院农大","东湖","韶光","龙华","檀木桥","曹家坪",
         "龙峰","大路村","木马缎","黄花机场T1T2"]
Line总 = Line1 + Line2 + Line3 + Line4 + Line5 + Line6
m = int(len(Line总) + 1)
import random
n = random.randint(0,m)
print("本次我们的目标站点是：" + Line总[n])